In [1]:
import numpy as np
import pandas as pd

In [6]:
s1 = pd.Series(np.arange(5), index = ['1','2','3','4','5'])
s1

1    0
2    1
3    2
4    3
5    4
dtype: int32

In [12]:
s1.drop(labels = ['1','4'])

2    1
3    2
5    4
dtype: int32

dataFrame的drop操作

In [13]:
df3 = pd.DataFrame(np.random.randn(4,4),index = ['A','B','C','D'],columns = ['c1','c2','c3','c4'] )
df3

         c1        c2        c3        c4
A -0.845945  0.463193  0.973166 -0.414693
B -1.223856  1.010822 -0.723420  0.029243
C -1.359656  0.020617  1.542809  0.254849
D  0.751108  1.280525  0.351743 -0.483171

In [14]:
df3.drop(['A','B'])
#drop 某些行被消除

         c1        c2        c3        c4
C -1.359656  0.020617  1.542809  0.254849
D  0.751108  1.280525  0.351743 -0.483171

In [16]:
df3.drop(['c2'],axis =1)
#如果需要对某一个列进行删除，axis = 1。

         c1        c3        c4
A -0.845945  0.973166 -0.414693
B -1.223856 -0.723420  0.029243
C -1.359656  1.542809  0.254849
D  0.751108  0.351743 -0.483171

如果需要对原来的df进行保存操作结果的话，drop里的inplace属性要转变为True

In [18]:
df3.drop(['c4'],axis = 1, inplace = True)
df3

         c1        c2        c3
A -0.845945  0.463193  0.973166
B -1.223856  1.010822 -0.723420
C -1.359656  0.020617  1.542809
D  0.751108  1.280525  0.351743

In [19]:
df3

         c1        c2        c3
A -0.845945  0.463193  0.973166
B -1.223856  1.010822 -0.723420
C -1.359656  0.020617  1.542809
D  0.751108  1.280525  0.351743